CncEngine.Example/GetToken/GetTokenRequest.xml

<?xml version="1.0" encoding="utf-8" ?>
<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
                  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:ver="http://2289467164.plentymarkets-x1.com/plenty/api/soap/version114/">
  <soapenv:Header/>
  <soapenv:Body>
    <ver:GetAuthentificationToken soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <oLogin xsi:type="ver:PlentySoapRequest_GetAuthentificationToken">
        <!--You may enter the following 2 items in any order-->
        <Username xsi:type="xsd:string">%username%</Username>
        <Userpass xsi:type="xsd:string">%password%</Userpass>
      </oLogin>
    </ver:GetAuthentificationToken>
  </soapenv:Body>
</soapenv:Envelope>